[
  {
    "page_num": 1,
    "text": "Denoising Diffusion Probabilistic Models\nJonathan Ho\nUC Berkeley\njonathanho@berkeley.edu\nAjay Jain\nUC Berkeley\najayj@berkeley.edu\nPieter Abbeel\nUC Berkeley\npabbeel@cs.berkeley.edu\nAbstract\nWe present high quality image synthesis results using diffusion probabilistic models,\na class of latent variable models inspired by considerations from nonequilibrium\nthermodynamics. Our best results are obtained by training on a weighted variational\nbound designed according to a novel connection between diffusion probabilistic\nmodels and denoising score matching with Langevin dynamics, and our models nat-\nurally admit a progressive lossy decompression scheme that can be interpreted as a\ngeneralization of autoregressive decoding. On the unconditional CIFAR10 dataset,\nwe obtain an Inception score of 9.46 and a state-of-the-art FID score of 3.17. On\n256x256 LSUN, we obtain sample quality similar to ProgressiveGAN. Our imple-\nmentation is available at https://github.com/hojonathanho/diffusion.\n1 Introduction\nDeep generative models of all kinds have recently exhibited high quality samples in a wide variety\nof data modalities. Generative adversarial networks (GANs), autoregressive models, ﬂows, and\nvariational autoencoders (V AEs) have synthesized striking image and audio samples [ 14, 27, 3,\n58, 38, 25, 10, 32, 44, 57, 26, 33, 45], and there have been remarkable advances in energy-based\nmodeling and score matching that have produced images comparable to those of GANs [11, 55].\nFigure 1: Generated samples on CelebA-HQ 256 ×256 (left) and unconditional CIFAR10 (right)\n34th Conference on Neural Information Processing Systems (NeurIPS 2020), Vancouver, Canada.\narXiv:2006.11239v2  [cs.LG]  16 Dec 2020",
    "extractor": "pypdf",
    "char_count": 1706
  },
  {
    "page_num": 2,
    "text": "\u0000!\n<latexit sha1_base64=\"7yFrn0YPyuP5dVIvc7Tl2zcbS/g=\">AAAB+HicbVBNSwMxEJ2tX7V+dNWjl2ARPJXdKuix6MVjBfsB7VKyaXYbmk2WJKvU0l/ixYMiXv0p3vw3pu0etPXBwOO9GWbmhSln2njet1NYW9/Y3Cpul3Z29/bL7sFhS8tMEdokkkvVCbGmnAnaNMxw2kkVxUnIaTsc3cz89gNVmklxb8YpDRIcCxYxgo2V+m65x6WIFYuHBislH/tuxat6c6BV4uekAjkafferN5AkS6gwhGOtu76XmmCClWGE02mpl2maYjLCMe1aKnBCdTCZHz5Fp1YZoEgqW8Kgufp7YoITrcdJaDsTbIZ62ZuJ/3ndzERXwYSJNDNUkMWiKOPISDRLAQ2YosTwsSWYKGZvRWSIFSbGZlWyIfjLL6+SVq3qn1drdxeV+nUeRxGO4QTOwIdLqMMtNKAJBDJ4hld4c56cF+fd+Vi0Fpx85gj+wPn8AXOGk5o=</latexit>\nx T \u0000! ··· \u0000! x t \u0000\u0000\u0000\u0000\u0000! x t \u0000 1 \u0000! ··· \u0000! x 0\n<latexit sha1_base64=\"l4LvSgM7PR7I/kkuy5soikK4gpU=\">AAAEoXictVLditNAFE7XqGv92a5eejOYLexKLU0VFKRQ9EYvhCrb3YUklOlk2g6dnzBzYrcb8zK+lU/gazhJK6atuiB4YODM+T/n+8YJZwY6nW+1vRvuzVu39+/U7967/+CgcfjwzKhUEzokiit9McaGcibpEBhwepFoisWY0/Px/G3hP/9MtWFKnsIyoZHAU8kmjGCwplHjeygwzAjThNM4Kz/jSXaZj05zFHIlp5pNZ4C1VgsUkliB2TX/oQLYCpe/4rJwZhJM6NPMJyLPt9IM0SwBA0tOUaVGBs/8/J8mWVRH6eSjhtdpd0pBu4q/VjxnLYPR4d7XMFYkFVQC4diYwO8kEGVYA7P183qYGmr3meMpDawqsaAmykpEctS0lhhNlLZPAiqt1YwMC2OWYmwjiynNtq8w/s4XpDB5FWVMJilQSVaNJilHoFABL4qZpgT40irYntTOisgMa0zAkqC+0QbY/MquIfCcYssbsBH1UNIFUUJgGVePGfhR1qyj1YETXAaH/SqAnp836/lGftUfdNcFiqbBT8L2jouQdvE9iVAoVUyDWONFa5XVYlJSjezEPT+BlmCSiVQgw65or2vBaE0Y5z1e4D/VeBmhstwJyo5C0YeZ53vdo/z19lhVjly71+K6xRb/ZbO/rbLCS8HMwmVZ7W9zeFc567b95+3uxxde/82a3/vOY+eJc+z4zkun77xzBs7QIbUPNVP7Ustdz33vDtxPq9C92jrnkbMhbvAD81mObw==</latexit>\np ✓ ( x t \u0000 1 | x t )\n<latexit sha1_base64=\"XVzP503G8Ma8Lkwk3KKGZcZJbZ0=\">AAACEnicbVC7SgNBFJ2Nrxhfq5Y2g0FICsNuFEwZsLGMYB6QLMvsZDYZMvtg5q4Y1nyDjb9iY6GIrZWdf+Mk2SImHrhwOOde7r3HiwVXYFk/Rm5tfWNzK79d2Nnd2z8wD49aKkokZU0aiUh2PKKY4CFrAgfBOrFkJPAEa3uj66nfvmdS8Si8g3HMnIAMQu5zSkBLrlmO3R4MGZBSLyAw9Pz0YeKmcG5P8CNekKDsmkWrYs2AV4mdkSLK0HDN714/oknAQqCCKNW1rRiclEjgVLBJoZcoFhM6IgPW1TQkAVNOOntpgs+00sd+JHWFgGfq4kRKAqXGgac7p0eqZW8q/ud1E/BrTsrDOAEW0vkiPxEYIjzNB/e5ZBTEWBNCJde3YjokklDQKRZ0CPbyy6ukVa3YF5Xq7WWxXsviyKMTdIpKyEZXqI5uUAM1EUVP6AW9oXfj2Xg1PozPeWvOyGaO0R8YX7+bCp4F</latexit>\nq ( x t | x t \u0000 1 )\n<latexit sha1_base64=\"eAZ87UuTmAQoJ4u19RGH5tA+bCI=\">AAACC3icbVC7TgJBFJ31ifhatbSZQEywkOyiiZQkNpaYyCMBspkdZmHC7MOZu0ay0tv4KzYWGmPrD9j5N87CFgieZJIz59ybe+9xI8EVWNaPsbK6tr6xmdvKb+/s7u2bB4dNFcaSsgYNRSjbLlFM8IA1gINg7Ugy4ruCtdzRVeq37plUPAxuYRyxnk8GAfc4JaAlxyzclbo+gaHrJQ8TB/AjnvsmcGZPTh2zaJWtKfAysTNSRBnqjvnd7Yc09lkAVBClOrYVQS8hEjgVbJLvxopFhI7IgHU0DYjPVC+Z3jLBJ1rpYy+U+gWAp+p8R0J8pca+qyvTRdWil4r/eZ0YvGov4UEUAwvobJAXCwwhToPBfS4ZBTHWhFDJ9a6YDokkFHR8eR2CvXjyMmlWyvZ5uXJzUaxVszhy6BgVUAnZ6BLV0DWqowai6Am9oDf0bjwbr8aH8TkrXTGyniP0B8bXL+1hmu8=</latexit>\nFigure 2: The directed graphical model considered in this work.\nThis paper presents progress in diffusion probabilistic models [53]. A diffusion probabilistic model\n(which we will call a “diffusion model” for brevity) is a parameterized Markov chain trained using\nvariational inference to produce samples matching the data after ﬁnite time. Transitions of this chain\nare learned to reverse a diffusion process, which is a Markov chain that gradually adds noise to the\ndata in the opposite direction of sampling until signal is destroyed. When the diffusion consists of\nsmall amounts of Gaussian noise, it is sufﬁcient to set the sampling chain transitions to conditional\nGaussians too, allowing for a particularly simple neural network parameterization.\nDiffusion models are straightforward to deﬁne and efﬁcient to train, but to the best of our knowledge,\nthere has been no demonstration that they are capable of generating high quality samples. We\nshow that diffusion models actually are capable of generating high quality samples, sometimes\nbetter than the published results on other types of generative models (Section 4). In addition, we\nshow that a certain parameterization of diffusion models reveals an equivalence with denoising\nscore matching over multiple noise levels during training and with annealed Langevin dynamics\nduring sampling (Section 3.2) [ 55, 61]. We obtained our best sample quality results using this\nparameterization (Section 4.2), so we consider this equivalence to be one of our primary contributions.\nDespite their sample quality, our models do not have competitive log likelihoods compared to other\nlikelihood-based models (our models do, however, have log likelihoods better than the large estimates\nannealed importance sampling has been reported to produce for energy based models and score\nmatching [11, 55]). We ﬁnd that the majority of our models’ lossless codelengths are consumed\nto describe imperceptible image details (Section 4.3). We present a more reﬁned analysis of this\nphenomenon in the language of lossy compression, and we show that the sampling procedure of\ndiffusion models is a type of progressive decoding that resembles autoregressive decoding along a bit\nordering that vastly generalizes what is normally possible with autoregressive models.\n2 Background\nDiffusion models [53] are latent variable models of the form pθ(x0) :=\n∫\npθ(x0:T) dx1:T, where\nx1,..., xT are latents of the same dimensionality as the data x0 ∼q(x0). The joint distribution\npθ(x0:T) is called the reverse process, and it is deﬁned as a Markov chain with learned Gaussian\ntransitions starting at p(xT) = N(xT; 0,I):\npθ(x0:T) := p(xT)\nT∏\nt=1\npθ(xt−1|xt), p θ(xt−1|xt) := N(xt−1; µθ(xt,t),Σθ(xt,t)) (1)\nWhat distinguishes diffusion models from other types of latent variable models is that the approximate\nposterior q(x1:T|x0), called the forward processor diffusion process, is ﬁxed to a Markov chain that\ngradually adds Gaussian noise to the data according to a variance schedule β1,...,β T:\nq(x1:T|x0) :=\nT∏\nt=1\nq(xt|xt−1), q (xt|xt−1) := N(xt;\n√\n1 −βtxt−1,βtI) (2)\nTraining is performed by optimizing the usual variational bound on negative log likelihood:\nE[−log pθ(x0)] ≤Eq\n[\n−log pθ(x0:T)\nq(x1:T|x0)\n]\n= Eq\n[\n−log p(xT) −\n∑\nt≥1\nlog pθ(xt−1|xt)\nq(xt|xt−1)\n]\n=: L (3)\nThe forward process variances βt can be learned by reparameterization [ 33] or held constant as\nhyperparameters, and expressiveness of the reverse process is ensured in part by the choice of\nGaussian conditionals in pθ(xt−1|xt), because both processes have the same functional form when\nβt are small [ 53]. A notable property of the forward process is that it admits sampling xt at an\narbitrary timestep tin closed form: using the notation αt := 1 −βt and ¯αt := ∏t\ns=1 αs, we have\nq(xt|x0) = N(xt; √¯αtx0,(1 −¯αt)I) (4)\n2",
    "extractor": "pypdf",
    "char_count": 6339
  },
  {
    "page_num": 3,
    "text": "Efﬁcient training is therefore possible by optimizing random terms of Lwith stochastic gradient\ndescent. Further improvements come from variance reduction by rewriting L(3) as:\nEq\n[\nDKL(q(xT|x0) ∥p(xT))  \nLT\n+\n∑\nt>1\nDKL(q(xt−1|xt,x0) ∥pθ(xt−1|xt))  \nLt−1\n−log pθ(x0|x1)  \nL0\n]\n(5)\n(See Appendix A for details. The labels on the terms are used in Section 3.) Equation (5) uses KL\ndivergence to directly compare pθ(xt−1|xt) against forward process posteriors, which are tractable\nwhen conditioned on x0:\nq(xt−1|xt,x0) = N(xt−1; ˜µt(xt,x0),˜βtI), (6)\nwhere ˜µt(xt,x0) :=\n√¯αt−1βt\n1 −¯αt\nx0 +\n√αt(1 −¯αt−1)\n1 −¯αt\nxt and ˜βt := 1 −¯αt−1\n1 −¯αt\nβt (7)\nConsequently, all KL divergences in Eq. (5) are comparisons between Gaussians, so they can be\ncalculated in a Rao-Blackwellized fashion with closed form expressions instead of high variance\nMonte Carlo estimates.\n3 Diffusion models and denoising autoencoders\nDiffusion models might appear to be a restricted class of latent variable models, but they allow a\nlarge number of degrees of freedom in implementation. One must choose the variances βt of the\nforward process and the model architecture and Gaussian distribution parameterization of the reverse\nprocess. To guide our choices, we establish a new explicit connection between diffusion models\nand denoising score matching (Section 3.2) that leads to a simpliﬁed, weighted variational bound\nobjective for diffusion models (Section 3.4). Ultimately, our model design is justiﬁed by simplicity\nand empirical results (Section 4). Our discussion is categorized by the terms of Eq. (5).\n3.1 Forward process and LT\nWe ignore the fact that the forward process variances βt are learnable by reparameterization and\ninstead ﬁx them to constants (see Section 4 for details). Thus, in our implementation, the approximate\nposterior qhas no learnable parameters, so LT is a constant during training and can be ignored.\n3.2 Reverse process and L1:T−1\nNow we discuss our choices in pθ(xt−1|xt) = N(xt−1; µθ(xt,t),Σθ(xt,t)) for 1 <t ≤T. First,\nwe set Σθ(xt,t) = σ2\ntI to untrained time dependent constants. Experimentally, both σ2\nt = βt and\nσ2\nt = ˜βt = 1−¯αt−1\n1−¯αt\nβt had similar results. The ﬁrst choice is optimal for x0 ∼N (0,I), and the\nsecond is optimal for x0 deterministically set to one point. These are the two extreme choices\ncorresponding to upper and lower bounds on reverse process entropy for data with coordinatewise\nunit variance [53].\nSecond, to represent the mean µθ(xt,t), we propose a speciﬁc parameterization motivated by the\nfollowing analysis of Lt. With pθ(xt−1|xt) = N(xt−1; µθ(xt,t),σ2\ntI), we can write:\nLt−1 = Eq\n[ 1\n2σ2\nt\n∥˜µt(xt,x0) −µθ(xt,t)∥2\n]\n+ C (8)\nwhere Cis a constant that does not depend on θ. So, we see that the most straightforward parameteri-\nzation of µθ is a model that predicts ˜µt, the forward process posterior mean. However, we can expand\nEq. (8) further by reparameterizing Eq. (4) as xt(x0,ϵ) = √¯αtx0 + √1 −¯αtϵ for ϵ ∼N(0,I) and\napplying the forward process posterior formula (7):\nLt−1 −C = Ex0,ϵ\n[\n1\n2σ2\nt\n˜µt\n(\nxt(x0,ϵ), 1√¯αt\n(xt(x0,ϵ) −\n√\n1 −¯αtϵ)\n)\n−µθ(xt(x0,ϵ),t)\n\n2]\n(9)\n= Ex0,ϵ\n[\n1\n2σ2\nt\n\n1√αt\n(\nxt(x0,ϵ) − βt√1 −¯αt\nϵ\n)\n−µθ(xt(x0,ϵ),t)\n\n2]\n(10)\n3",
    "extractor": "pypdf",
    "char_count": 3224
  },
  {
    "page_num": 4,
    "text": "Algorithm 1 Training\n1: repeat\n2: x0 ∼q(x0)\n3: t∼Uniform({1,...,T })\n4: ϵ ∼N(0,I)\n5: Take gradient descent step on\n∇θ\nϵ −ϵθ(√¯αtx0 + √1 −¯αtϵ,t)\n2\n6: until converged\nAlgorithm 2 Sampling\n1: xT ∼N(0,I)\n2: for t= T,..., 1 do\n3: z ∼N(0,I) if t> 1, else z = 0\n4: xt−1 = 1√αt\n(\nxt − 1−αt√1−¯αt\nϵθ(xt,t)\n)\n+ σtz\n5: end for\n6: return x0\nEquation (10) reveals that µθ must predict 1√αt\n(\nxt − βt√1−¯αt\nϵ\n)\ngiven xt. Since xt is available as\ninput to the model, we may choose the parameterization\nµθ(xt,t) = ˜µt\n(\nxt, 1√¯αt\n(xt −\n√\n1 −¯αtϵθ(xt))\n)\n= 1√αt\n(\nxt − βt√1 −¯αt\nϵθ(xt,t)\n)\n(11)\nwhere ϵθ is a function approximator intended to predict ϵ from xt. To sample xt−1 ∼pθ(xt−1|xt) is\nto compute xt−1 = 1√αt\n(\nxt − βt√1−¯αt\nϵθ(xt,t)\n)\n+σtz, where z ∼N(0,I). The complete sampling\nprocedure, Algorithm 2, resembles Langevin dynamics with ϵθ as a learned gradient of the data\ndensity. Furthermore, with the parameterization (11), Eq. (10) simpliﬁes to:\nEx0,ϵ\n[ β2\nt\n2σ2\ntαt(1 −¯αt)\nϵ −ϵθ(√¯αtx0 +\n√\n1 −¯αtϵ,t)\n2\n]\n(12)\nwhich resembles denoising score matching over multiple noise scales indexed by t[55]. As Eq. (12)\nis equal to (one term of) the variational bound for the Langevin-like reverse process (11), we see\nthat optimizing an objective resembling denoising score matching is equivalent to using variational\ninference to ﬁt the ﬁnite-time marginal of a sampling chain resembling Langevin dynamics.\nTo summarize, we can train the reverse process mean function approximator µθ to predict ˜µt, or by\nmodifying its parameterization, we can train it to predict ϵ. (There is also the possibility of predicting\nx0, but we found this to lead to worse sample quality early in our experiments.) We have shown that\nthe ϵ-prediction parameterization both resembles Langevin dynamics and simpliﬁes the diffusion\nmodel’s variational bound to an objective that resembles denoising score matching. Nonetheless,\nit is just another parameterization of pθ(xt−1|xt), so we verify its effectiveness in Section 4 in an\nablation where we compare predicting ϵ against predicting ˜µt.\n3.3 Data scaling, reverse process decoder, and L0\nWe assume that image data consists of integers in {0,1,..., 255}scaled linearly to [−1,1]. This\nensures that the neural network reverse process operates on consistently scaled inputs starting from\nthe standard normal prior p(xT). To obtain discrete log likelihoods, we set the last term of the reverse\nprocess to an independent discrete decoder derived from the Gaussian N(x0; µθ(x1,1),σ2\n1I):\npθ(x0|x1) =\nD∏\ni=1\n∫ δ+(xi\n0)\nδ−(xi\n0)\nN(x; µi\nθ(x1,1),σ2\n1) dx\nδ+(x) =\n{∞ if x= 1\nx+ 1\n255 if x< 1 δ−(x) =\n{−∞ if x= −1\nx− 1\n255 if x> −1\n(13)\nwhere D is the data dimensionality and the i superscript indicates extraction of one coordinate.\n(It would be straightforward to instead incorporate a more powerful decoder like a conditional\nautoregressive model, but we leave that to future work.) Similar to the discretized continuous\ndistributions used in V AE decoders and autoregressive models [34, 52], our choice here ensures that\nthe variational bound is a lossless codelength of discrete data, without need of adding noise to the\ndata or incorporating the Jacobian of the scaling operation into the log likelihood. At the end of\nsampling, we display µθ(x1,1) noiselessly.\n3.4 Simpliﬁed training objective\nWith the reverse process and decoder deﬁned above, the variational bound, consisting of terms derived\nfrom Eqs. (12) and (13), is clearly differentiable with respect to θand is ready to be employed for\n4",
    "extractor": "pypdf",
    "char_count": 3521
  },
  {
    "page_num": 5,
    "text": "Table 1: CIFAR10 results. NLL measured in bits/dim.\nModel IS FID NLL Test (Train)\nConditional\nEBM [11] 8.30 37 .9\nJEM [17] 8.76 38 .4\nBigGAN [3] 9.22 14 .73\nStyleGAN2 + ADA (v1) [29] 10.06 2 .67\nUnconditional\nDiffusion (original) [53] ≤5.40\nGated PixelCNN [59] 4.60 65 .93 3 .03 (2.90)\nSparse Transformer [7] 2.80\nPixelIQN [43] 5.29 49 .46\nEBM [11] 6.78 38 .2\nNCSNv2 [56] 31.75\nNCSN [55] 8.87±0.12 25 .32\nSNGAN [39] 8.22±0.05 21 .7\nSNGAN-DDLS [4] 9.09±0.10 15 .42\nStyleGAN2 + ADA (v1) [29] 9.74 ±0.05 3 .26\nOurs (L, ﬁxed isotropic Σ) 7.67±0.13 13 .51 ≤3.70 (3.69)\nOurs (Lsimple) 9.46±0.11 3.17 ≤3.75 (3.72)\nTable 2: Unconditional CIFAR10 reverse\nprocess parameterization and training objec-\ntive ablation. Blank entries were unstable to\ntrain and generated poor samples with out-of-\nrange scores.\nObjective IS FID\n˜µ prediction (baseline)\nL, learned diagonal Σ 7.28±0.10 23 .69\nL, ﬁxed isotropic Σ 8.06±0.09 13 .22\n∥˜µ −˜µθ∥2 – –\nϵ prediction (ours)\nL, learned diagonal Σ – –\nL, ﬁxed isotropic Σ 7.67±0.13 13 .51\n∥˜ϵ −ϵθ∥2 (Lsimple) 9.46±0.11 3 .17\ntraining. However, we found it beneﬁcial to sample quality (and simpler to implement) to train on the\nfollowing variant of the variational bound:\nLsimple(θ) := Et,x0,ϵ\n[ϵ −ϵθ(√¯αtx0 +\n√\n1 −¯αtϵ,t)\n2]\n(14)\nwhere tis uniform between 1 and T. The t = 1 case corresponds to L0 with the integral in the\ndiscrete decoder deﬁnition (13) approximated by the Gaussian probability density function times the\nbin width, ignoring σ2\n1 and edge effects. The t >1 cases correspond to an unweighted version of\nEq. (12), analogous to the loss weighting used by the NCSN denoising score matching model [55].\n(LT does not appear because the forward process variances βt are ﬁxed.) Algorithm 1 displays the\ncomplete training procedure with this simpliﬁed objective.\nSince our simpliﬁed objective (14) discards the weighting in Eq. (12), it is a weighted variational\nbound that emphasizes different aspects of reconstruction compared to the standard variational\nbound [18, 22]. In particular, our diffusion process setup in Section 4 causes the simpliﬁed objective\nto down-weight loss terms corresponding to small t. These terms train the network to denoise data\nwith very small amounts of noise, so it is beneﬁcial to down-weight them so that the network can\nfocus on more difﬁcult denoising tasks at larger tterms. We will see in our experiments that this\nreweighting leads to better sample quality.\n4 Experiments\nWe set T = 1000 for all experiments so that the number of neural network evaluations needed\nduring sampling matches previous work [53, 55]. We set the forward process variances to constants\nincreasing linearly from β1 = 10 −4 to βT = 0 .02. These constants were chosen to be small\nrelative to data scaled to [−1,1], ensuring that reverse and forward processes have approximately\nthe same functional form while keeping the signal-to-noise ratio at xT as small as possible (LT =\nDKL(q(xT|x0) ∥N(0,I)) ≈10−5 bits per dimension in our experiments).\nTo represent the reverse process, we use a U-Net backbone similar to an unmasked PixelCNN++ [52,\n48] with group normalization throughout [66]. Parameters are shared across time, which is speciﬁed\nto the network using the Transformer sinusoidal position embedding [60]. We use self-attention at\nthe 16 ×16 feature map resolution [63, 60]. Details are in Appendix B.\n4.1 Sample quality\nTable 1 shows Inception scores, FID scores, and negative log likelihoods (lossless codelengths) on\nCIFAR10. With our FID score of 3.17, our unconditional model achieves better sample quality than\nmost models in the literature, including class conditional models. Our FID score is computed with\nrespect to the training set, as is standard practice; when we compute it with respect to the test set, the\nscore is 5.24, which is still better than many of the training set FID scores in the literature.\n5",
    "extractor": "pypdf",
    "char_count": 3877
  },
  {
    "page_num": 6,
    "text": "Figure 3: LSUN Church samples. FID=7.89\n Figure 4: LSUN Bedroom samples. FID=4.90\nAlgorithm 3 Sending x0\n1: Send xT ∼q(xT|x0) using p(xT)\n2: for t= T −1,..., 2,1 do\n3: Send xt ∼q(xt|xt+1,x0) using pθ(xt|xt+1)\n4: end for\n5: Send x0 using pθ(x0|x1)\nAlgorithm 4 Receiving\n1: Receive xT using p(xT)\n2: for t= T −1,..., 1,0 do\n3: Receive xt using pθ(xt|xt+1)\n4: end for\n5: return x0\nWe ﬁnd that training our models on the true variational bound yields better codelengths than training\non the simpliﬁed objective, as expected, but the latter yields the best sample quality. See Fig. 1 for\nCIFAR10 and CelebA-HQ 256 ×256 samples, Fig. 3 and Fig. 4 for LSUN 256 ×256 samples [71],\nand Appendix D for more.\n4.2 Reverse process parameterization and training objective ablation\nIn Table 2, we show the sample quality effects of reverse process parameterizations and training\nobjectives (Section 3.2). We ﬁnd that the baseline option of predicting ˜µ works well only when\ntrained on the true variational bound instead of unweighted mean squared error, a simpliﬁed objective\nakin to Eq. (14). We also see that learning reverse process variances (by incorporating a parameterized\ndiagonal Σθ(xt) into the variational bound) leads to unstable training and poorer sample quality\ncompared to ﬁxed variances. Predicting ϵ, as we proposed, performs approximately as well as\npredicting ˜µ when trained on the variational bound with ﬁxed variances, but much better when trained\nwith our simpliﬁed objective.\n4.3 Progressive coding\nTable 1 also shows the codelengths of our CIFAR10 models. The gap between train and test is at\nmost 0.03 bits per dimension, which is comparable to the gaps reported with other likelihood-based\nmodels and indicates that our diffusion model is not overﬁtting (see Appendix D for nearest neighbor\nvisualizations). Still, while our lossless codelengths are better than the large estimates reported for\nenergy based models and score matching using annealed importance sampling [ 11], they are not\ncompetitive with other types of likelihood-based generative models [7].\nSince our samples are nonetheless of high quality, we conclude that diffusion models have an inductive\nbias that makes them excellent lossy compressors. Treating the variational bound termsL1 +···+LT\nas rate and L0 as distortion, our CIFAR10 model with the highest quality samples has a rate of 1.78\nbits/dim and a distortion of 1.97 bits/dim, which amounts to a root mean squared error of 0.95 on a\nscale from 0 to 255. More than half of the lossless codelength describes imperceptible distortions.\nProgressive lossy compression We can probe further into the rate-distortion behavior of our model\nby introducing a progressive lossy code that mirrors the form of Eq. (5): see Algorithms 3 and 4,\nwhich assume access to a procedure, such as minimal random coding [19, 20], that can transmit a\nsample x ∼q(x) using approximately DKL(q(x) ∥p(x)) bits on average for any distributions pand\nq, for which onlypis available to the receiver beforehand. When applied tox0 ∼q(x0), Algorithms 3\nand 4 transmit xT,..., x0 in sequence using a total expected codelength equal to Eq. (5). The receiver,\n6",
    "extractor": "pypdf",
    "char_count": 3164
  },
  {
    "page_num": 7,
    "text": "at any time t, has the partial information xt fully available and can progressively estimate:\nx0 ≈ˆx0 =\n(\nxt −\n√\n1 −¯αtϵθ(xt)\n)\n/√¯αt (15)\ndue to Eq. (4). (A stochastic reconstruction x0 ∼pθ(x0|xt) is also valid, but we do not consider\nit here because it makes distortion more difﬁcult to evaluate.) Figure 5 shows the resulting rate-\ndistortion plot on the CIFAR10 test set. At each time t, the distortion is calculated as the root mean\nsquared error\n√\n∥x0 −ˆx0∥2/D, and the rate is calculated as the cumulative number of bits received\nso far at time t. The distortion decreases steeply in the low-rate region of the rate-distortion plot,\nindicating that the majority of the bits are indeed allocated to imperceptible distortions.\n0 200 400 600 800 1,000\n0\n20\n40\n60\n80\nReverse process steps (T −t)\nDistortion (RMSE)\n0 200 400 600 800 1,000\n0\n0.5\n1\n1.5\nReverse process steps (T −t)\nRate (bits/dim)\n0 0.5 1 1.5\n0\n20\n40\n60\n80\nRate (bits/dim)\nDistortion (RMSE)\nFigure 5: Unconditional CIFAR10 test set rate-distortion vs. time. Distortion is measured in root mean squared\nerror on a [0,255] scale. See Table 4 for details.\nProgressive generation We also run a progressive unconditional generation process given by\nprogressive decompression from random bits. In other words, we predict the result of the reverse\nprocess, ˆx0, while sampling from the reverse process using Algorithm 2. Figures 6 and 10 show the\nresulting sample quality of ˆx0 over the course of the reverse process. Large scale image features\nappear ﬁrst and details appear last. Figure 7 shows stochastic predictions x0 ∼pθ(x0|xt) with xt\nfrozen for various t. When tis small, all but ﬁne details are preserved, and when tis large, only large\nscale features are preserved. Perhaps these are hints of conceptual compression [18].\nFigure 6: Unconditional CIFAR10 progressive generation (ˆx0 over time, from left to right). Extended samples\nand sample quality metrics over time in the appendix (Figs. 10 and 14).\nFigure 7: When conditioned on the same latent, CelebA-HQ 256 ×256 samples share high-level attributes.\nBottom-right quadrants are xt, and other quadrants are samples from pθ(x0|xt).\nConnection to autoregressive decoding Note that the variational bound (5) can be rewritten as:\nL= DKL(q(xT) ∥p(xT)) + Eq\n[∑\nt≥1\nDKL(q(xt−1|xt) ∥pθ(xt−1|xt))\n]\n+ H(x0) (16)\n(See Appendix A for a derivation.) Now consider setting the diffusion process length T to the\ndimensionality of the data, deﬁning the forward process so that q(xt|x0) places all probability mass\non x0 with the ﬁrst tcoordinates masked out (i.e. q(xt|xt−1) masks out the tth coordinate), setting\np(xT) to place all mass on a blank image, and, for the sake of argument, taking pθ(xt−1|xt) to\n7",
    "extractor": "pypdf",
    "char_count": 2719
  },
  {
    "page_num": 8,
    "text": "Figure 8: Interpolations of CelebA-HQ 256x256 images with 500 timesteps of diffusion.\nbe a fully expressive conditional distribution. With these choices, DKL(q(xT) ∥p(xT)) = 0, and\nminimizing DKL(q(xt−1|xt) ∥pθ(xt−1|xt)) trains pθ to copy coordinates t+ 1,...,T unchanged\nand to predict the tth coordinate given t+ 1,...,T . Thus, training pθ with this particular diffusion is\ntraining an autoregressive model.\nWe can therefore interpret the Gaussian diffusion model (2) as a kind of autoregressive model with\na generalized bit ordering that cannot be expressed by reordering data coordinates. Prior work has\nshown that such reorderings introduce inductive biases that have an impact on sample quality [38],\nso we speculate that the Gaussian diffusion serves a similar purpose, perhaps to greater effect since\nGaussian noise might be more natural to add to images compared to masking noise. Moreover, the\nGaussian diffusion length is not restricted to equal the data dimension; for instance, we useT = 1000,\nwhich is less than the dimension of the 32 ×32 ×3 or 256 ×256 ×3 images in our experiments.\nGaussian diffusions can be made shorter for fast sampling or longer for model expressiveness.\n4.4 Interpolation\nWe can interpolate source images x0,x′\n0 ∼q(x0) in latent space using q as a stochastic encoder,\nxt,x′\nt ∼q(xt|x0), then decoding the linearly interpolated latent ¯xt = (1 −λ)x0 + λx′\n0 into image\nspace by the reverse process, ¯x0 ∼p(x0|¯xt). In effect, we use the reverse process to remove\nartifacts from linearly interpolating corrupted versions of the source images, as depicted in Fig. 8\n(left). We ﬁxed the noise for different values of λ so xt and x′\nt remain the same. Fig. 8 (right)\nshows interpolations and reconstructions of original CelebA-HQ 256 ×256 images (t= 500). The\nreverse process produces high-quality reconstructions, and plausible interpolations that smoothly\nvary attributes such as pose, skin tone, hairstyle, expression and background, but not eyewear. Larger\ntresults in coarser and more varied interpolations, with novel samples at t= 1000 (Appendix Fig. 9).\n5 Related Work\nWhile diffusion models might resemble ﬂows [ 9, 46, 10, 32, 5, 16, 23] and V AEs [33, 47, 37],\ndiffusion models are designed so that qhas no parameters and the top-level latent xT has nearly zero\nmutual information with the data x0. Our ϵ-prediction reverse process parameterization establishes a\nconnection between diffusion models and denoising score matching over multiple noise levels with\nannealed Langevin dynamics for sampling [55, 56]. Diffusion models, however, admit straightforward\nlog likelihood evaluation, and the training procedure explicitly trains the Langevin dynamics sampler\nusing variational inference (see Appendix C for details). The connection also has the reverse\nimplication that a certain weighted form of denoising score matching is the same as variational\ninference to train a Langevin-like sampler. Other methods for learning transition operators of Markov\nchains include infusion training [2], variational walkback [15], generative stochastic networks [1],\nand others [50, 54, 36, 42, 35, 65].\nBy the known connection between score matching and energy-based modeling, our work could have\nimplications for other recent work on energy-based models [67–69, 12, 70, 13, 11, 41, 17, 8]. Our\nrate-distortion curves are computed over time in one evaluation of the variational bound, reminiscent\nof how rate-distortion curves can be computed over distortion penalties in one run of annealed\nimportance sampling [24]. Our progressive decoding argument can be seen in convolutional DRAW\nand related models [ 18, 40] and may also lead to more general designs for subscale orderings or\nsampling strategies for autoregressive models [38, 64].\n8",
    "extractor": "pypdf",
    "char_count": 3775
  },
  {
    "page_num": 9,
    "text": "6 Conclusion\nWe have presented high quality image samples using diffusion models, and we have found connections\namong diffusion models and variational inference for training Markov chains, denoising score\nmatching and annealed Langevin dynamics (and energy-based models by extension), autoregressive\nmodels, and progressive lossy compression. Since diffusion models seem to have excellent inductive\nbiases for image data, we look forward to investigating their utility in other data modalities and as\ncomponents in other types of generative models and machine learning systems.\nBroader Impact\nOur work on diffusion models takes on a similar scope as existing work on other types of deep\ngenerative models, such as efforts to improve the sample quality of GANs, ﬂows, autoregressive\nmodels, and so forth. Our paper represents progress in making diffusion models a generally useful\ntool in this family of techniques, so it may serve to amplify any impacts that generative models have\nhad (and will have) on the broader world.\nUnfortunately, there are numerous well-known malicious uses of generative models. Sample gen-\neration techniques can be employed to produce fake images and videos of high proﬁle ﬁgures for\npolitical purposes. While fake images were manually created long before software tools were avail-\nable, generative models such as ours make the process easier. Fortunately, CNN-generated images\ncurrently have subtle ﬂaws that allow detection [62], but improvements in generative models may\nmake this more difﬁcult. Generative models also reﬂect the biases in the datasets on which they\nare trained. As many large datasets are collected from the internet by automated systems, it can be\ndifﬁcult to remove these biases, especially when the images are unlabeled. If samples from generative\nmodels trained on these datasets proliferate throughout the internet, then these biases will only be\nreinforced further.\nOn the other hand, diffusion models may be useful for data compression, which, as data becomes\nhigher resolution and as global internet trafﬁc increases, might be crucial to ensure accessibility of\nthe internet to wide audiences. Our work might contribute to representation learning on unlabeled\nraw data for a large range of downstream tasks, from image classiﬁcation to reinforcement learning,\nand diffusion models might also become viable for creative uses in art, photography, and music.\nAcknowledgments and Disclosure of Funding\nThis work was supported by ONR PECASE and the NSF Graduate Research Fellowship under grant\nnumber DGE-1752814. Google’s TensorFlow Research Cloud (TFRC) provided Cloud TPUs.\nReferences\n[1] Guillaume Alain, Yoshua Bengio, Li Yao, Jason Yosinski, Eric Thibodeau-Laufer, Saizheng Zhang, and\nPascal Vincent. GSNs: generative stochastic networks. Information and Inference: A Journal of the IMA,\n5(2):210–249, 2016.\n[2] Florian Bordes, Sina Honari, and Pascal Vincent. Learning to generate samples from noise through infusion\ntraining. In International Conference on Learning Representations, 2017.\n[3] Andrew Brock, Jeff Donahue, and Karen Simonyan. Large scale GAN training for high ﬁdelity natural\nimage synthesis. In International Conference on Learning Representations, 2019.\n[4] Tong Che, Ruixiang Zhang, Jascha Sohl-Dickstein, Hugo Larochelle, Liam Paull, Yuan Cao, and Yoshua\nBengio. Your GAN is secretly an energy-based model and you should use discriminator driven latent\nsampling. arXiv preprint arXiv:2003.06060, 2020.\n[5] Tian Qi Chen, Yulia Rubanova, Jesse Bettencourt, and David K Duvenaud. Neural ordinary differential\nequations. In Advances in Neural Information Processing Systems, pages 6571–6583, 2018.\n[6] Xi Chen, Nikhil Mishra, Mostafa Rohaninejad, and Pieter Abbeel. PixelSNAIL: An improved autoregres-\nsive generative model. In International Conference on Machine Learning, pages 863–871, 2018.\n[7] Rewon Child, Scott Gray, Alec Radford, and Ilya Sutskever. Generating long sequences with sparse\ntransformers. arXiv preprint arXiv:1904.10509, 2019.\n9",
    "extractor": "pypdf",
    "char_count": 4027
  },
  {
    "page_num": 10,
    "text": "[8] Yuntian Deng, Anton Bakhtin, Myle Ott, Arthur Szlam, and Marc’Aurelio Ranzato. Residual energy-based\nmodels for text generation. arXiv preprint arXiv:2004.11714, 2020.\n[9] Laurent Dinh, David Krueger, and Yoshua Bengio. NICE: Non-linear independent components estimation.\narXiv preprint arXiv:1410.8516, 2014.\n[10] Laurent Dinh, Jascha Sohl-Dickstein, and Samy Bengio. Density estimation using Real NVP. arXiv\npreprint arXiv:1605.08803, 2016.\n[11] Yilun Du and Igor Mordatch. Implicit generation and modeling with energy based models. In Advances in\nNeural Information Processing Systems, pages 3603–3613, 2019.\n[12] Ruiqi Gao, Yang Lu, Junpei Zhou, Song-Chun Zhu, and Ying Nian Wu. Learning generative ConvNets\nvia multi-grid modeling and sampling. In Proceedings of the IEEE Conference on Computer Vision and\nPattern Recognition, pages 9155–9164, 2018.\n[13] Ruiqi Gao, Erik Nijkamp, Diederik P Kingma, Zhen Xu, Andrew M Dai, and Ying Nian Wu. Flow\ncontrastive estimation of energy-based models. In Proceedings of the IEEE/CVF Conference on Computer\nVision and Pattern Recognition, pages 7518–7528, 2020.\n[14] Ian Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, Bing Xu, David Warde-Farley, Sherjil Ozair, Aaron\nCourville, and Yoshua Bengio. Generative adversarial nets. In Advances in Neural Information Processing\nSystems, pages 2672–2680, 2014.\n[15] Anirudh Goyal, Nan Rosemary Ke, Surya Ganguli, and Yoshua Bengio. Variational walkback: Learning a\ntransition operator as a stochastic recurrent net. In Advances in Neural Information Processing Systems,\npages 4392–4402, 2017.\n[16] Will Grathwohl, Ricky T. Q. Chen, Jesse Bettencourt, and David Duvenaud. FFJORD: Free-form\ncontinuous dynamics for scalable reversible generative models. In International Conference on Learning\nRepresentations, 2019.\n[17] Will Grathwohl, Kuan-Chieh Wang, Joern-Henrik Jacobsen, David Duvenaud, Mohammad Norouzi, and\nKevin Swersky. Your classiﬁer is secretly an energy based model and you should treat it like one. In\nInternational Conference on Learning Representations, 2020.\n[18] Karol Gregor, Frederic Besse, Danilo Jimenez Rezende, Ivo Danihelka, and Daan Wierstra. Towards\nconceptual compression. In Advances In Neural Information Processing Systems, pages 3549–3557, 2016.\n[19] Prahladh Harsha, Rahul Jain, David McAllester, and Jaikumar Radhakrishnan. The communication\ncomplexity of correlation. In Twenty-Second Annual IEEE Conference on Computational Complexity\n(CCC’07), pages 10–23. IEEE, 2007.\n[20] Marton Havasi, Robert Peharz, and José Miguel Hernández-Lobato. Minimal random code learning:\nGetting bits back from compressed model parameters. In International Conference on Learning Represen-\ntations, 2019.\n[21] Martin Heusel, Hubert Ramsauer, Thomas Unterthiner, Bernhard Nessler, and Sepp Hochreiter. GANs\ntrained by a two time-scale update rule converge to a local Nash equilibrium. In Advances in Neural\nInformation Processing Systems, pages 6626–6637, 2017.\n[22] Irina Higgins, Loic Matthey, Arka Pal, Christopher Burgess, Xavier Glorot, Matthew Botvinick, Shakir Mo-\nhamed, and Alexander Lerchner. beta-V AE: Learning basic visual concepts with a constrained variational\nframework. In International Conference on Learning Representations, 2017.\n[23] Jonathan Ho, Xi Chen, Aravind Srinivas, Yan Duan, and Pieter Abbeel. Flow++: Improving ﬂow-based\ngenerative models with variational dequantization and architecture design. In International Conference on\nMachine Learning, 2019.\n[24] Sicong Huang, Alireza Makhzani, Yanshuai Cao, and Roger Grosse. Evaluating lossy compression rates of\ndeep generative models. In International Conference on Machine Learning, 2020.\n[25] Nal Kalchbrenner, Aaron van den Oord, Karen Simonyan, Ivo Danihelka, Oriol Vinyals, Alex Graves, and\nKoray Kavukcuoglu. Video pixel networks. In International Conference on Machine Learning, pages\n1771–1779, 2017.\n[26] Nal Kalchbrenner, Erich Elsen, Karen Simonyan, Seb Noury, Norman Casagrande, Edward Lockhart,\nFlorian Stimberg, Aaron van den Oord, Sander Dieleman, and Koray Kavukcuoglu. Efﬁcient neural audio\nsynthesis. In International Conference on Machine Learning, pages 2410–2419, 2018.\n[27] Tero Karras, Timo Aila, Samuli Laine, and Jaakko Lehtinen. Progressive growing of GANs for improved\nquality, stability, and variation. In International Conference on Learning Representations, 2018.\n[28] Tero Karras, Samuli Laine, and Timo Aila. A style-based generator architecture for generative adversarial\nnetworks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages\n10",
    "extractor": "pypdf",
    "char_count": 4587
  },
  {
    "page_num": 11,
    "text": "4401–4410, 2019.\n[29] Tero Karras, Miika Aittala, Janne Hellsten, Samuli Laine, Jaakko Lehtinen, and Timo Aila. Training\ngenerative adversarial networks with limited data. arXiv preprint arXiv:2006.06676v1, 2020.\n[30] Tero Karras, Samuli Laine, Miika Aittala, Janne Hellsten, Jaakko Lehtinen, and Timo Aila. Analyzing and\nimproving the image quality of StyleGAN. In Proceedings of the IEEE/CVF Conference on Computer\nVision and Pattern Recognition, pages 8110–8119, 2020.\n[31] Diederik P Kingma and Jimmy Ba. Adam: A method for stochastic optimization. In International\nConference on Learning Representations, 2015.\n[32] Diederik P Kingma and Prafulla Dhariwal. Glow: Generative ﬂow with invertible 1x1 convolutions. In\nAdvances in Neural Information Processing Systems, pages 10215–10224, 2018.\n[33] Diederik P Kingma and Max Welling. Auto-encoding variational Bayes. arXiv preprint arXiv:1312.6114,\n2013.\n[34] Diederik P Kingma, Tim Salimans, Rafal Jozefowicz, Xi Chen, Ilya Sutskever, and Max Welling. Improved\nvariational inference with inverse autoregressive ﬂow. In Advances in Neural Information Processing\nSystems, pages 4743–4751, 2016.\n[35] John Lawson, George Tucker, Bo Dai, and Rajesh Ranganath. Energy-inspired models: Learning with\nsampler-induced distributions. In Advances in Neural Information Processing Systems, pages 8501–8513,\n2019.\n[36] Daniel Levy, Matt D. Hoffman, and Jascha Sohl-Dickstein. Generalizing Hamiltonian Monte Carlo with\nneural networks. In International Conference on Learning Representations, 2018.\n[37] Lars Maaløe, Marco Fraccaro, Valentin Liévin, and Ole Winther. BIV A: A very deep hierarchy of\nlatent variables for generative modeling. In Advances in Neural Information Processing Systems, pages\n6548–6558, 2019.\n[38] Jacob Menick and Nal Kalchbrenner. Generating high ﬁdelity images with subscale pixel networks and\nmultidimensional upscaling. In International Conference on Learning Representations, 2019.\n[39] Takeru Miyato, Toshiki Kataoka, Masanori Koyama, and Yuichi Yoshida. Spectral normalization for\ngenerative adversarial networks. In International Conference on Learning Representations, 2018.\n[40] Alex Nichol. VQ-DRAW: A sequential discrete V AE. arXiv preprint arXiv:2003.01599, 2020.\n[41] Erik Nijkamp, Mitch Hill, Tian Han, Song-Chun Zhu, and Ying Nian Wu. On the anatomy of MCMC-based\nmaximum likelihood learning of energy-based models. arXiv preprint arXiv:1903.12370, 2019.\n[42] Erik Nijkamp, Mitch Hill, Song-Chun Zhu, and Ying Nian Wu. Learning non-convergent non-persistent\nshort-run MCMC toward energy-based model. In Advances in Neural Information Processing Systems,\npages 5233–5243, 2019.\n[43] Georg Ostrovski, Will Dabney, and Remi Munos. Autoregressive quantile networks for generative modeling.\nIn International Conference on Machine Learning, pages 3936–3945, 2018.\n[44] Ryan Prenger, Rafael Valle, and Bryan Catanzaro. WaveGlow: A ﬂow-based generative network for\nspeech synthesis. In ICASSP 2019-2019 IEEE International Conference on Acoustics, Speech and Signal\nProcessing (ICASSP), pages 3617–3621. IEEE, 2019.\n[45] Ali Razavi, Aaron van den Oord, and Oriol Vinyals. Generating diverse high-ﬁdelity images with VQ-\nV AE-2. InAdvances in Neural Information Processing Systems, pages 14837–14847, 2019.\n[46] Danilo Rezende and Shakir Mohamed. Variational inference with normalizing ﬂows. In International\nConference on Machine Learning, pages 1530–1538, 2015.\n[47] Danilo Jimenez Rezende, Shakir Mohamed, and Daan Wierstra. Stochastic backpropagation and approx-\nimate inference in deep generative models. In International Conference on Machine Learning, pages\n1278–1286, 2014.\n[48] Olaf Ronneberger, Philipp Fischer, and Thomas Brox. U-Net: Convolutional networks for biomedical\nimage segmentation. In International Conference on Medical Image Computing and Computer-Assisted\nIntervention, pages 234–241. Springer, 2015.\n[49] Tim Salimans and Durk P Kingma. Weight normalization: A simple reparameterization to accelerate\ntraining of deep neural networks. In Advances in Neural Information Processing Systems, pages 901–909,\n2016.\n[50] Tim Salimans, Diederik Kingma, and Max Welling. Markov Chain Monte Carlo and variational inference:\nBridging the gap. In International Conference on Machine Learning, pages 1218–1226, 2015.\n11",
    "extractor": "pypdf",
    "char_count": 4306
  },
  {
    "page_num": 12,
    "text": "[51] Tim Salimans, Ian Goodfellow, Wojciech Zaremba, Vicki Cheung, Alec Radford, and Xi Chen. Improved\ntechniques for training gans. In Advances in Neural Information Processing Systems, pages 2234–2242,\n2016.\n[52] Tim Salimans, Andrej Karpathy, Xi Chen, and Diederik P Kingma. PixelCNN++: Improving the PixelCNN\nwith discretized logistic mixture likelihood and other modiﬁcations. In International Conference on\nLearning Representations, 2017.\n[53] Jascha Sohl-Dickstein, Eric Weiss, Niru Maheswaranathan, and Surya Ganguli. Deep unsupervised\nlearning using nonequilibrium thermodynamics. In International Conference on Machine Learning, pages\n2256–2265, 2015.\n[54] Jiaming Song, Shengjia Zhao, and Stefano Ermon. A-NICE-MC: Adversarial training for MCMC. In\nAdvances in Neural Information Processing Systems, pages 5140–5150, 2017.\n[55] Yang Song and Stefano Ermon. Generative modeling by estimating gradients of the data distribution. In\nAdvances in Neural Information Processing Systems, pages 11895–11907, 2019.\n[56] Yang Song and Stefano Ermon. Improved techniques for training score-based generative models. arXiv\npreprint arXiv:2006.09011, 2020.\n[57] Aaron van den Oord, Sander Dieleman, Heiga Zen, Karen Simonyan, Oriol Vinyals, Alex Graves, Nal\nKalchbrenner, Andrew Senior, and Koray Kavukcuoglu. WaveNet: A generative model for raw audio.\narXiv preprint arXiv:1609.03499, 2016.\n[58] Aaron van den Oord, Nal Kalchbrenner, and Koray Kavukcuoglu. Pixel recurrent neural networks.\nInternational Conference on Machine Learning, 2016.\n[59] Aaron van den Oord, Nal Kalchbrenner, Oriol Vinyals, Lasse Espeholt, Alex Graves, and Koray\nKavukcuoglu. Conditional image generation with PixelCNN decoders. In Advances in Neural Information\nProcessing Systems, pages 4790–4798, 2016.\n[60] Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz\nKaiser, and Illia Polosukhin. Attention is all you need. In Advances in Neural Information Processing\nSystems, pages 5998–6008, 2017.\n[61] Pascal Vincent. A connection between score matching and denoising autoencoders. Neural Computation,\n23(7):1661–1674, 2011.\n[62] Sheng-Yu Wang, Oliver Wang, Richard Zhang, Andrew Owens, and Alexei A Efros. Cnn-generated images\nare surprisingly easy to spot...for now. In Proceedings of the IEEE Conference on Computer Vision and\nPattern Recognition, 2020.\n[63] Xiaolong Wang, Ross Girshick, Abhinav Gupta, and Kaiming He. Non-local neural networks. In\nProceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 7794–7803,\n2018.\n[64] Auke J Wiggers and Emiel Hoogeboom. Predictive sampling with forecasting autoregressive models.\narXiv preprint arXiv:2002.09928, 2020.\n[65] Hao Wu, Jonas Köhler, and Frank Noé. Stochastic normalizing ﬂows. arXiv preprint arXiv:2002.06707,\n2020.\n[66] Yuxin Wu and Kaiming He. Group normalization. InProceedings of the European Conference on Computer\nVision (ECCV), pages 3–19, 2018.\n[67] Jianwen Xie, Yang Lu, Song-Chun Zhu, and Yingnian Wu. A theory of generative convnet. InInternational\nConference on Machine Learning, pages 2635–2644, 2016.\n[68] Jianwen Xie, Song-Chun Zhu, and Ying Nian Wu. Synthesizing dynamic patterns by spatial-temporal\ngenerative convnet. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition,\npages 7093–7101, 2017.\n[69] Jianwen Xie, Zilong Zheng, Ruiqi Gao, Wenguan Wang, Song-Chun Zhu, and Ying Nian Wu. Learning\ndescriptor networks for 3d shape synthesis and analysis. In Proceedings of the IEEE Conference on\nComputer Vision and Pattern Recognition, pages 8629–8638, 2018.\n[70] Jianwen Xie, Song-Chun Zhu, and Ying Nian Wu. Learning energy-based spatial-temporal generative\nconvnets for dynamic patterns. IEEE Transactions on Pattern Analysis and Machine Intelligence, 2019.\n[71] Fisher Yu, Yinda Zhang, Shuran Song, Ari Seff, and Jianxiong Xiao. LSUN: Construction of a large-scale\nimage dataset using deep learning with humans in the loop. arXiv preprint arXiv:1506.03365, 2015.\n[72] Sergey Zagoruyko and Nikos Komodakis. Wide residual networks. arXiv preprint arXiv:1605.07146,\n2016.\n12",
    "extractor": "pypdf",
    "char_count": 4124
  },
  {
    "page_num": 13,
    "text": "Extra information\nLSUN FID scores for LSUN datasets are included in Table 3. Scores marked with ∗are reported\nby StyleGAN2 as baselines, and other scores are reported by their respective authors.\nTable 3: FID scores for LSUN 256 ×256 datasets\nModel LSUN Bedroom LSUN Church LSUN Cat\nProgressiveGAN [27] 8.34 6.42 37.52\nStyleGAN [28] 2.65 4.21∗ 8.53∗\nStyleGAN2 [30] - 3.86 6.93\nOurs (Lsimple) 6.36 7.89 19.75\nOurs (Lsimple, large) 4.90 - -\nProgressive compression Our lossy compression argument in Section 4.3 is only a proof of concept,\nbecause Algorithms 3 and 4 depend on a procedure such as minimal random coding [20], which is\nnot tractable for high dimensional data. These algorithms serve as a compression interpretation of the\nvariational bound (5) of Sohl-Dickstein et al. [53], not yet as a practical compression system.\nTable 4: Unconditional CIFAR10 test set rate-distortion values (accompanies Fig. 5)\nReverse process time (T −t+ 1) Rate (bits/dim) Distortion (RMSE [0,255])\n1000 1.77581 0.95136\n900 0.11994 12.02277\n800 0.05415 18.47482\n700 0.02866 24.43656\n600 0.01507 30.80948\n500 0.00716 38.03236\n400 0.00282 46.12765\n300 0.00081 54.18826\n200 0.00013 60.97170\n100 0.00000 67.60125\nA Extended derivations\nBelow is a derivation of Eq. (5), the reduced variance variational bound for diffusion models. This\nmaterial is from Sohl-Dickstein et al. [53]; we include it here only for completeness.\nL= Eq\n[\n−log pθ(x0:T)\nq(x1:T|x0)\n]\n(17)\n= Eq\n\n−log p(xT) −\n∑\nt≥1\nlog pθ(xt−1|xt)\nq(xt|xt−1)\n\n (18)\n= Eq\n[\n−log p(xT) −\n∑\nt>1\nlog pθ(xt−1|xt)\nq(xt|xt−1) −log pθ(x0|x1)\nq(x1|x0)\n]\n(19)\n= Eq\n[\n−log p(xT) −\n∑\nt>1\nlog pθ(xt−1|xt)\nq(xt−1|xt,x0) ·q(xt−1|x0)\nq(xt|x0) −log pθ(x0|x1)\nq(x1|x0)\n]\n(20)\n= Eq\n[\n−log p(xT)\nq(xT|x0) −\n∑\nt>1\nlog pθ(xt−1|xt)\nq(xt−1|xt,x0) −log pθ(x0|x1)\n]\n(21)\n13",
    "extractor": "pypdf",
    "char_count": 1791
  },
  {
    "page_num": 14,
    "text": "= Eq\n[\nDKL(q(xT|x0) ∥p(xT)) +\n∑\nt>1\nDKL(q(xt−1|xt,x0) ∥pθ(xt−1|xt)) −log pθ(x0|x1)\n]\n(22)\nThe following is an alternate version of L. It is not tractable to estimate, but it is useful for our\ndiscussion in Section 4.3.\nL= Eq\n\n−log p(xT) −\n∑\nt≥1\nlog pθ(xt−1|xt)\nq(xt|xt−1)\n\n (23)\n= Eq\n\n−log p(xT) −\n∑\nt≥1\nlog pθ(xt−1|xt)\nq(xt−1|xt) ·q(xt−1)\nq(xt)\n\n (24)\n= Eq\n\n−log p(xT)\nq(xT) −\n∑\nt≥1\nlog pθ(xt−1|xt)\nq(xt−1|xt) −log q(x0)\n\n (25)\n= DKL(q(xT) ∥p(xT)) + Eq\n\n∑\nt≥1\nDKL(q(xt−1|xt) ∥pθ(xt−1|xt))\n\n+ H(x0) (26)\nB Experimental details\nOur neural network architecture follows the backbone of PixelCNN++ [52], which is a U-Net [48]\nbased on a Wide ResNet [72]. We replaced weight normalization [49] with group normalization [66]\nto make the implementation simpler. Our 32 ×32 models use four feature map resolutions (32 ×32\nto 4 ×4), and our 256 ×256 models use six. All models have two convolutional residual blocks\nper resolution level and self-attention blocks at the 16 ×16 resolution between the convolutional\nblocks [6]. Diffusion time tis speciﬁed by adding the Transformer sinusoidal position embedding [60]\ninto each residual block. Our CIFAR10 model has 35.7 million parameters, and our LSUN and\nCelebA-HQ models have 114 million parameters. We also trained a larger variant of the LSUN\nBedroom model with approximately 256 million parameters by increasing ﬁlter count.\nWe used TPU v3-8 (similar to 8 V100 GPUs) for all experiments. Our CIFAR model trains at 21\nsteps per second at batch size 128 (10.6 hours to train to completion at 800k steps), and sampling\na batch of 256 images takes 17 seconds. Our CelebA-HQ/LSUN (256 2) models train at 2.2 steps\nper second at batch size 64, and sampling a batch of 128 images takes 300 seconds. We trained on\nCelebA-HQ for 0.5M steps, LSUN Bedroom for 2.4M steps, LSUN Cat for 1.8M steps, and LSUN\nChurch for 1.2M steps. The larger LSUN Bedroom model was trained for 1.15M steps.\nApart from an initial choice of hyperparameters early on to make network size ﬁt within memory\nconstraints, we performed the majority of our hyperparameter search to optimize for CIFAR10 sample\nquality, then transferred the resulting settings over to the other datasets:\n• We chose the βt schedule from a set of constant, linear, and quadratic schedules, all\nconstrained so that LT ≈0. We set T = 1000 without a sweep, and we chose a linear\nschedule from β1 = 10−4 to βT = 0.02.\n• We set the dropout rate on CIFAR10 to0.1 by sweeping over the values {0.1,0.2,0.3,0.4}.\nWithout dropout on CIFAR10, we obtained poorer samples reminiscent of the overﬁtting\nartifacts in an unregularized PixelCNN++ [52]. We set dropout rate on the other datasets to\nzero without sweeping.\n• We used random horizontal ﬂips during training for CIFAR10; we tried training both with\nand without ﬂips, and found ﬂips to improve sample quality slightly. We also used random\nhorizontal ﬂips for all other datasets except LSUN Bedroom.\n• We tried Adam [31] and RMSProp early on in our experimentation process and chose the\nformer. We left the hyperparameters to their standard values. We set the learning rate to\n2 ×10−4 without any sweeping, and we lowered it to 2 ×10−5 for the 256 ×256 images,\nwhich seemed unstable to train with the larger learning rate.\n14",
    "extractor": "pypdf",
    "char_count": 3271
  },
  {
    "page_num": 15,
    "text": "• We set the batch size to 128 for CIFAR10 and 64 for larger images. We did not sweep over\nthese values.\n• We used EMA on model parameters with a decay factor of 0.9999. We did not sweep over\nthis value.\nFinal experiments were trained once and evaluated throughout training for sample quality. Sample\nquality scores and log likelihood are reported on the minimum FID value over the course of training.\nOn CIFAR10, we calculated Inception and FID scores on 50000 samples using the original code\nfrom the OpenAI [ 51] and TTUR [ 21] repositories, respectively. On LSUN, we calculated FID\nscores on 50000 samples using code from the StyleGAN2 [30] repository. CIFAR10 and CelebA-HQ\nwere loaded as provided by TensorFlow Datasets ( https://www.tensorflow.org/datasets),\nand LSUN was prepared using code from StyleGAN. Dataset splits (or lack thereof) are standard\nfrom the papers that introduced their usage in a generative modeling context. All details can be found\nin the source code release.\nC Discussion on related work\nOur model architecture, forward process deﬁnition, and prior differ from NCSN [55, 56] in subtle but\nimportant ways that improve sample quality, and, notably, we directly train our sampler as a latent\nvariable model rather than adding it after training post-hoc. In greater detail:\n1. We use a U-Net with self-attention; NCSN uses a ReﬁneNet with dilated convolutions. We\ncondition all layers on tby adding in the Transformer sinusoidal position embedding, rather\nthan only in normalization layers (NCSNv1) or only at the output (v2).\n2. Diffusion models scale down the data with each forward process step (by a √1 −βt factor)\nso that variance does not grow when adding noise, thus providing consistently scaled inputs\nto the neural net reverse process. NCSN omits this scaling factor.\n3. Unlike NCSN, our forward process destroys signal (DKL(q(xT|x0) ∥N(0,I)) ≈0), ensur-\ning a close match between the prior and aggregate posterior of xT. Also unlike NCSN, our\nβt are very small, which ensures that the forward process is reversible by a Markov chain\nwith conditional Gaussians. Both of these factors prevent distribution shift when sampling.\n4. Our Langevin-like sampler has coefﬁcients (learning rate, noise scale, etc.) derived rig-\norously from βt in the forward process. Thus, our training procedure directly trains our\nsampler to match the data distribution after T steps: it trains the sampler as a latent variable\nmodel using variational inference. In contrast, NCSN’s sampler coefﬁcients are set by hand\npost-hoc, and their training procedure is not guaranteed to directly optimize a quality metric\nof their sampler.\nD Samples\nAdditional samples Figure 11, 13, 16, 17, 18, and 19 show uncurated samples from the diffusion\nmodels trained on CelebA-HQ, CIFAR10 and LSUN datasets.\nLatent structure and reverse process stochasticity During sampling, both the prior xT ∼\nN(0,I) and Langevin dynamics are stochastic. To understand the signiﬁcance of the second source\nof noise, we sampled multiple images conditioned on the same intermediate latent for the CelebA\n256 ×256 dataset. Figure 7 shows multiple draws from the reverse process x0 ∼pθ(x0|xt) that\nshare the latent xt for t∈{1000,750,500,250}. To accomplish this, we run a single reverse chain\nfrom an initial draw from the prior. At the intermediate timesteps, the chain is split to sample multiple\nimages. When the chain is split after the prior draw at xT=1000, the samples differ signiﬁcantly.\nHowever, when the chain is split after more steps, samples share high-level attributes like gender,\nhair color, eyewear, saturation, pose and facial expression. This indicates that intermediate latents\nlike x750 encode these attributes, despite their imperceptibility.\nCoarse-to-ﬁne interpolation Figure 9 shows interpolations between a pair of source CelebA\n256 ×256 images as we vary the number of diffusion steps prior to latent space interpolation.\nIncreasing the number of diffusion steps destroys more structure in the source images, which the\n15",
    "extractor": "pypdf",
    "char_count": 4032
  },
  {
    "page_num": 16,
    "text": "model completes during the reverse process. This allows us to interpolate at both ﬁne granularities\nand coarse granularities. In the limiting case of 0 diffusion steps, the interpolation mixes source\nimages in pixel space. On the other hand, after 1000 diffusion steps, source information is lost and\ninterpolations are novel samples.\nSource Rec. λ=0.1 λ=0.2 λ=0.3 λ=0.4 λ=0.5 λ=0.6 λ=0.7 λ=0.8 λ=0.9 Rec. Source\n1000 steps\n875 steps\n750 steps\n625 steps\n500 steps\n375 steps\n250 steps\n125 steps\n0 steps\nFigure 9: Coarse-to-ﬁne interpolations that vary the number of diffusion steps prior to latent mixing.\n0 200 400 600 800 1,000\n2\n4\n6\n8\n10\nReverse process steps (T −t)\nInception Score\n0 200 400 600 800 1,000\n0\n100\n200\n300\nReverse process steps (T −t)\nFID\nFigure 10: Unconditional CIFAR10 progressive sampling quality over time\n16",
    "extractor": "pypdf",
    "char_count": 830
  },
  {
    "page_num": 17,
    "text": "Figure 11: CelebA-HQ 256 ×256 generated samples\n17",
    "extractor": "pypdf",
    "char_count": 50
  },
  {
    "page_num": 18,
    "text": "(a) Pixel space nearest neighbors\n(b) Inception feature space nearest neighbors\nFigure 12: CelebA-HQ 256 ×256 nearest neighbors, computed on a 100 ×100 crop surrounding the\nfaces. Generated samples are in the leftmost column, and training set nearest neighbors are in the\nremaining columns.\n18",
    "extractor": "pypdf",
    "char_count": 293
  },
  {
    "page_num": 19,
    "text": "Figure 13: Unconditional CIFAR10 generated samples\n19",
    "extractor": "pypdf",
    "char_count": 53
  },
  {
    "page_num": 20,
    "text": "Figure 14: Unconditional CIFAR10 progressive generation\n20",
    "extractor": "pypdf",
    "char_count": 58
  },
  {
    "page_num": 21,
    "text": "(a) Pixel space nearest neighbors\n(b) Inception feature space nearest neighbors\nFigure 15: Unconditional CIFAR10 nearest neighbors. Generated samples are in the leftmost column,\nand training set nearest neighbors are in the remaining columns.\n21",
    "extractor": "pypdf",
    "char_count": 245
  },
  {
    "page_num": 22,
    "text": "Figure 16: LSUN Church generated samples. FID=7.89\n22",
    "extractor": "pypdf",
    "char_count": 53
  },
  {
    "page_num": 23,
    "text": "Figure 17: LSUN Bedroom generated samples, large model. FID=4.90\n23",
    "extractor": "pypdf",
    "char_count": 67
  },
  {
    "page_num": 24,
    "text": "Figure 18: LSUN Bedroom generated samples, small model. FID=6.36\n24",
    "extractor": "pypdf",
    "char_count": 67
  },
  {
    "page_num": 25,
    "text": "Figure 19: LSUN Cat generated samples. FID=19.75\n25",
    "extractor": "pypdf",
    "char_count": 51
  }
]